Repository: N0va1992/Numerical-Methods
Catalog: Resource.*.resx
Languages: pl_pl

# absError1
source: Absolute error:
pl_pl: Błąd bezwzględny:

# absoluteErrorLabel
source: Absolute error:
pl_pl: Błąd bezwzględny:

# accuracyLabel
source: Accuracy:
pl_pl: Dokładnośc:

# addBtn
source: Add
pl_pl: Dodaj

# addMsg
source: Point added
pl_pl: Dodano punkt

# appNumber
source: Approximate number
pl_pl: Liczba przybliżona:

# approxfuncBnt
source: Approximation Function
pl_pl: Aproksymacje

# approxFuncTask1Task
source: Write and run a computer application that, based on the data from the following table: i xi yi 1 2 2.5 2 4 10 3 6 32 4 8 40 5 10 60 will find the linear approximating function.
pl_pl: Napisz i uruchom aplikację komputerową, która na podstawie danych z poniższej tabeli: i xi yi 1 2 2.5 2 4 10 3 6 32 4 8 40 5 10 60 znajdzie liniową funkcję aproksymacyjną

# approxFuncTitle
source: Aproximation Functions
pl_pl: Aproksymacje

# approximationsBtn
source: Approximations
pl_pl: Przybliżenia

# approxTitle
source: Approximations
pl_pl: Przybiżenia

# appValue1
source: Approximate value:
pl_pl: Wartość przybliżona:

# backBtn
source: Back
pl_pl: Powrót

# backwardBtn
source: Backward differences
pl_pl: Różnice wsteczne

# calculateBtn
source: Calculate
pl_pl: Oblicz

# coefficientsLabel
source: Coefficients:
pl_pl: Współczynniki:

source: Column
pl_pl: Kolumna

source: Different
pl_pl: Różnica

# differentiationBtn
source: Differentiation
pl_pl: Różniczkowanie

# differentiationTask
source: Write and run a computer application that takes at least four pairs of points (x, f(x)), then calculates: Progressive differences, Backward differences, Divided differences between the corresponding pairs of points. If performing these operations is not possible, the program should inform the user about it.
pl_pl: Napisz i uruchom aplikację komputerową pobierający co najmniej cztery pary punktów (x, f(x)), a następnie obliczającą: 1. różnice progresywne, 2. różnice wsteczne, 3. ilorazy różnicowe pomiędzy odpowiednimi parami punktów. Jeżeli wykonanie tej operacji jest niemożliwe program powinien poinformować o tym użytkownika.

# differentiationTitle
source: Differentiation
pl_pl: Różniczkowanie

# dividedBtn
source: Divided differences
pl_pl: Ilorazy różnicowe

# errorMsg
source: Invalid x or y values. Check the entered data.
pl_pl: Nieprawidłowe wartości x lub y. Sprawdź wprowadzone dane.

# exNumber
source: Exact number:
pl_pl: Liczba dokładna:

# formTitle
source: Introduction to Numerical Methods
pl_pl: Wstęp do metod numerycznych

# integrationsBtn
source: Integrations
pl_pl: Całkowanie

# integrationsTask
source: Write and run a computer application that calculates the definite integral of a polynomial W(x) of at least the third degree defined on a given interval [a, b] using three methods: 1. Rectangle method, 2. Trapezoidal method, 3. Parabolic method, with a specified level of accuracy. Compare and analyze the obtained results and the efficiency of these methods (e.g., the number of iterations required to achieve the desired accuracy).
pl_pl: Napisz i uruchom aplikację komputerową obliczająca wartość całki z wielomianu W(x) rzędu co najmniej trzeciego i zdefiniowanego na zadanym przedziale [a, b] trzema metodami: 1. metodą prostokątów, 2. metodą trapezów, 3. metodą parabol, z zadaną z góry dokładnością. Porównaj i przeanalizuj otrzymane wyniki oraz efektywność tych metod (np. liczbę wykonanych iteracji do osiągnięcia pożądanej dokładności).

# integrationsTitle
source: Integrations
pl_pl: Całkowanie

# interpolationsBtn
source: Interpolations
pl_pl: Interpolacje

# interpolationTitle
source: Interpolations
pl_pl: Interpolacje

# interTaskText
source: Write and run a computer application that, based on four pairs of values (x, f(x)), finds the third-degree interpolating polynomial approximating this function f(x). If performing this operation is not possible, the program should inform the user about it.
pl_pl: Napisz i uruchom aplikację komputerową, która na podstawie wprowadzonych czterech par wielkości (x, f(x)) znajduje wielomian interpolacyjny trzeciego stopnia przybliżający tę funkcję f(x).Jeżeli wykonanie tej operacji jest niemożliwe, to program powinien poinformować o tym użytkownika.

source: Invalid values
pl_pl: Błędne dane

# iterationsTxt
source: Iterations number:
pl_pl: Liczba iteracji:

# languageBtn
source: Change language
pl_pl: Zmień język

# notEnoughtMsg
source: You need at least two points for progressive differences calculations.
pl_pl: Potrzebujesz co najmniej dwóch punktów do obliczeń różnic progresywnych.

# overestimationText
source: Overstimination:
pl_pl: Przybliżenie z nadmiarem:

# parabolicMethodBtn
source: Parabolic method
pl_pl: Metoda parabol

# parabolicTitle
source: Parabolic method
pl_pl: Metoda parabol

# progressiveBtn
source: Progressive differences
pl_pl: Różnice progresywne

# progressiveTitle
source: Progressive differences
pl_pl: Różnice progresywne

# rectangleMethodBtn
source: Rectangle method
pl_pl: Metoda prostokątów

# rectangleTitle
source: Rectangle method
pl_pl: Metoda prostokątów

# relativeErrorLabel
source: Relative error:
pl_pl: Błąd względny:

# resultTextLabel
source: Result:
pl_pl: Wynik:

# resultTxt
source: Integral value:
pl_pl: Wartość całki:

# task11Btn
source: Task 1
pl_pl: Zadanie 1

# task11Task
source: Write and run a computer application calculating the relative and absolute error after entering two numbers: the exact one and the approximate one.
pl_pl: Napisz i uruchom aplikację komputerową obliczającą błąd względny i bezwzględny po wprowadzeniu dwu liczb: dokładnej i przybliżonej.

# task12Btn
source: Task 2
pl_pl: Zadanie 2

# task12Task
source: Write and run a computer application that finds the exact value of a number if we enter its approximate value and its absolute error for two cases: 1. The number is underestimated. 2. The number is overestimated.
pl_pl: Napisz i uruchom aplikację komputerową znajdująca dokładną wartość liczby, jeśli wprowadzimy jej wartość przybliżoną i jej błąd bezwzględny dla dwu przypadków: 1. liczba jest przybliżeniem z niedomiarem, 2. liczba jest przybliżeniem z nadmiarem.

# Task31Task
source: Write and run a computer application that, based on the following data: (0.955, 5.722), (1.38, 4.812), (1.854, 4.727), (2.093, 4.850), (2.674, 5.011), (3.006, 5.253), (3.255, 5.617), (3.940, 6.282), (4.060, 6.255), using the following basic functions: 1/x, x, x^2, will find the approximative function.
pl_pl: Napisz i uruchom aplikację komputerową, która na podstawie poniższych danych: (0.955, 5.722), (1.38, 4.812), (1.854, 4.727), (2.093, 4.850), (2.674, 5.011), (3.006, 5.253), (3.255, 5.617), (3.940, 6.282), (4.060, 6.255) używając jako funkcji bazowych następujących funkcji: 1/x , x , x2, znajdzie funkcję aproksymacyjną.

# trapezoidalMethodBtn
source: Trapezoidal method
pl_pl: Metoda trapezów

# trapezTitle
source: Trapezodial method
pl_pl: Metoda trapezów

# underestimationText
source: Understimination:
pl_pl: Przybliżenie z niedomiarem:
